<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 自定义配置
// +----------------------------------------------------------------------
return [
    'token_expire_time' => '604800', // 登录过期时间单位秒 七天免登陆
    'upload_subdir'		=> 'Ymd',				//文件上传二级目录 标准的日期格式
    'nocheck'			=> ['admin/Login/login'],	//不需要验证权限的url
    'dump_extension'	=> 'xlsx',				//默认导出格式
    'filetype'	=> 'jpg,jpeg,png,gif,mp4',  //上传文件文件类型
    'filesize'	=> 50,				            //上传文件最大限制(M)
];
